In [1]:
import pandas as pd
data = {
    'Yil': [2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
    'Aholi soni': [33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5],
    'Temp' : [1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53]   
}
df = pd.DataFrame(data)

In [2]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [5]:
df.head()

    Yil  Aholi soni  temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65

In [6]:
df.head(3)

    Yil  Aholi soni  temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56

In [9]:
df.shape

(8, 3)

In [14]:
df = pd.DataFrame(data, columns = ['Yil', 'Temp', 'Aholi soni', 'YAIM'])

In [15]:
df

    Yil  Temp  Aholi soni YAIM
0  2021  1.54        33.9  NaN
1  2020  1.48        33.5  NaN
2  2019  1.56        32.9  NaN
3  2018  1.62        32.5  NaN
4  2017  1.65        31.9  NaN
5  2016  1.66        31.4  NaN
6  2015  1.64        30.9  NaN
7  2010  1.53        28.5  NaN

In [16]:
df = pd.DataFrame(data, columns = ['Yil', 'Temp', 'Aholi soni', 'YAIM'], index = list(range(1, 9)))

In [17]:
df

    Yil  Temp  Aholi soni YAIM
1  2021  1.54        33.9  NaN
2  2020  1.48        33.5  NaN
3  2019  1.56        32.9  NaN
4  2018  1.62        32.5  NaN
5  2017  1.65        31.9  NaN
6  2016  1.66        31.4  NaN
7  2015  1.64        30.9  NaN
8  2010  1.53        28.5  NaN

In [21]:
aholi = df['Aholi soni']

In [22]:
aholi

1    33.9
2    33.5
3    32.9
4    32.5
5    31.9
6    31.4
7    30.9
8    28.5
Name: Aholi soni, dtype: float64

In [23]:
type(aholi)

pandas.core.series.Series

In [24]:
df.YAIM = 0

In [25]:
df

    Yil  Temp  Aholi soni  YAIM
1  2021  1.54        33.9     0
2  2020  1.48        33.5     0
3  2019  1.56        32.9     0
4  2018  1.62        32.5     0
5  2017  1.65        31.9     0
6  2016  1.66        31.4     0
7  2015  1.64        30.9     0
8  2010  1.53        28.5     0

In [26]:
val = pd.Series([1700, 1650, 1300], index = [1, 2, 8])

In [6]:
df.YAIM = val

In [7]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [15]:
val = [1700, 1670, 1600, 1590, 1400, 1300, 1350, 1360]
df.YAIM = val
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [17]:
#df['1500+'] = df.YAIM>1500

In [31]:
df

    Yil  Temp  Aholi soni  YAIM  1500+
1  2021  1.54        33.9  1700   True
2  2020  1.48        33.5  1670   True
3  2019  1.56        32.9  1600   True
4  2018  1.62        32.5  1590   True
5  2017  1.65        31.9  1400  False
6  2016  1.66        31.4  1300  False
7  2015  1.64        30.9  1350  False
8  2010  1.53        28.5  1360  False

In [21]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [35]:
data2 = {
    'Uzbekistan':{2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'Kazakhstan':{2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8}
}

In [38]:
df2 = pd.DataFrame(data2)

In [39]:
df2

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [40]:
df2.T

            2021  2020  2019  2018  2017  2016
Uzbekistan  33.9  33.5  32.9  32.5  31.9   NaN
Kazakhstan  18.9  18.7  18.5  18.3  18.1  17.8

In [41]:
df2.index.name = "Yil"

In [42]:
df2

      Uzbekistan  Kazakhstan
Yil
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [43]:
df2.T

Yil         2021  2020  2019  2018  2017  2016
Uzbekistan  33.9  33.5  32.9  32.5  31.9   NaN
Kazakhstan  18.9  18.7  18.5  18.3  18.1  17.8

In [44]:
df3 = pd.DataFrame(data2, index = [2021, 2019, 2017])

In [45]:
df3

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2019        32.9        18.5
2017        31.9        18.1

In [46]:
df3.T

            2021  2019  2017
Uzbekistan  33.9  32.9  31.9
Kazakhstan  18.9  18.5  18.1

In [48]:
df2.values

array([[33.9, 18.9],
       [33.5, 18.7],
       [32.9, 18.5],
       [32.5, 18.3],
       [31.9, 18.1],
       [ nan, 17.8]])

In [50]:
df

    Yil  Temp  Aholi soni  YAIM
1  2021  1.54        33.9  1700
2  2020  1.48        33.5  1670
3  2019  1.56        32.9  1600
4  2018  1.62        32.5  1590
5  2017  1.65        31.9  1400
6  2016  1.66        31.4  1300
7  2015  1.64        30.9  1350
8  2010  1.53        28.5  1360

In [51]:
indeks = df.index

In [52]:
indeks

Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64')

In [53]:
indeks[0]

1

In [54]:
indeks[3:5]

Index([4, 5], dtype='int64')

In [57]:
df.columns

Index(['Yil', 'Temp', 'Aholi soni', 'YAIM'], dtype='object')

In [63]:
usernames = {"anvar":"anvarbek223", "olim":"olimtoy", "maryam":"mary334455","javohir":"javohir445"}
emails = {"anvar":"anvar@gmail.com", "olim":"olim@mail.ru", "maryam":"mary33@gmail.com","javohir":"javohir445@gmail.com"}

data = {
    'username':usernames,
    'email':emails
}
df = pd.DataFrame(data)

In [64]:
df

            username                 email
anvar    anvarbek223       anvar@gmail.com
olim         olimtoy          olim@mail.ru
maryam    mary334455      mary33@gmail.com
javohir   javohir445  javohir445@gmail.com

In [67]:
data2 = {
    'username':{"olim":"olimjon21", "maryam":"maryam2020"},
    'email':{"olim":"olimjon21@mail.ru", "maryam":"maryam20@gmail.com"}
}

In [69]:
df2 = df.append(pd.DataFrame(data2))

AttributeError: 'DataFrame' object has no attribute 'append'

In [70]:
df.index

Index(['anvar', 'olim', 'maryam', 'javohir'], dtype='object')

In [71]:
newind = pd.Index(['olim', 'nafisa', 'hamida'])
newind

Index(['olim', 'nafisa', 'hamida'], dtype='object')

In [72]:
newind.isin(df.index)

array([ True, False, False])

In [73]:
df.index.difference(newind)

Index(['anvar', 'javohir', 'maryam'], dtype='object')

In [77]:
df.index.union(newind)

Index(['anvar', 'hamida', 'javohir', 'maryam', 'nafisa', 'olim'], dtype='object')

In [78]:
df.index

Index(['anvar', 'olim', 'maryam', 'javohir'], dtype='object')

In [79]:
df.index.delete(0)

Index(['olim', 'maryam', 'javohir'], dtype='object')

In [80]:
df.index.drop('javohir')

Index(['anvar', 'olim', 'maryam'], dtype='object')

In [85]:
df.index.insert(2, 'Masha')
df.index

Index(['anvar', 'olim', 'maryam', 'javohir'], dtype='object')

In [90]:
df.index.is_monotonic

AttributeError: 'Index' object has no attribute 'is_monotonic'

In [91]:
df.index.is_unique

True

In [22]:
df.index.unique()

RangeIndex(start=0, stop=8, step=1)

In [23]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [24]:
df.columns

Index(['Yil', 'Aholi soni', 'Temp'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [26]:
df2

NameError: name 'df2' is not defined

In [28]:
'Temp' in df

True